EQMOD/REJSACAN_OBDWEB/src/RJA_OBDWEB_V1/esp32_obd2.cpp
  for (int retries = 10; retries > 0; retries--) {
    if (CANMod.sendFrame(outgoing)) {
      // send success
      break;
    } else if (retries <= 1) {
      return 0;
    }
  }

  bool splitResponse = (length > 5);

  CAN_FRAME incoming;
  for (unsigned long start = millis(); (millis() - start) < _responseTimeout;) {
    
	if ( CANMod.read(incoming) != 0 ) {
      _lastPidResponseMillis = millis();

      if (!splitResponse && incoming.data.uint8[1] == (mode | 0x40) && incoming.data.uint8[2] == pid) {
        for (uint8_t i=0; i<length; i++) {
		  ((uint8_t*)data)[i] = incoming.data.uint8[i+3];
		}
        return length;
      }


      // Is multiple packets
      if (incoming.data.uint8[0] == 0x10) {
        int read = 0;

        // Get first packet
		//////// Why only read three of the remaining six bytes in the first packet: 
		//////// int read = CAN.readBytes((uint8_t*)data, 3); 
        while (read<3) {	
	  	  ((uint8_t*)data)[read] = incoming.data.uint8[read+2];
		  read++;
        }
				
		// Loop through rest of multiple packets
        for (int pck = 0; read<length; pck++) {
          delay(60);
		  
          // send the request for the next chunk
          outgoing.data.uint8[0] = 0x30;  
          CANMod.sendFrame(outgoing);
		
          // wait for (proper) response
          while ( CANMod.read(incoming) != 0 || incoming.data.uint8[0] != (0x21 + pck)); // correct sequence number

          // Something recieved
		  for (uint8_t i=0; i<7 && read<length; i++) {
	        ((uint8_t*)data)[read++] = incoming.data.uint8[i+1];
		  }
        }

        _lastPidResponseMillis = millis();
        return read;
	  }
    }
  }
  return 0;
}


OBD2Class OBD2;
